package com.diverapp.diverapp.SignupLogin;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.widget.TextView;

import com.diverapp.diverapp.R;

public class TermsAndConditions extends AppCompatActivity {

    TextView condtionTV,userTypeTV;
    public int userType;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_terms_and_conditions);
        condtionTV = (TextView) findViewById(R.id.condtionTV);
        userTypeTV = (TextView) findViewById(R.id.userTypeTV);
        userType = getIntent().getIntExtra("USER_TYPE",0);
        String tirms = termsAndCondintion(userType);
        condtionTV.setText(tirms);
    }
    public String termsAndCondintion(int userTyp){
        if (userTyp== 1 ){
            // proDiver
            userTypeTV.setText("الشروط والأحكام ( محترف الغواص ):\n\n");
            String terms = "\u25CF  يقر محترف الغوص أن الغوص يعتبر من الأنشطة الخطيرة التي قد تسبب الوفاة لا سمح الله أو العجز الدائم ، وعليه فإن محترف الغوص يخلي مسئولية إدارة تطبيق غواص من أي التزامات قانونية يتعرضون لها قبل أو أثناء أو بعد الغوص أو بسببه. \n" +
                    "\u25CF  يؤكد محترف الغوص أنه ملتزم بمعايير السلامة الدولية، وأن يمارس أنشطته في حدود تدريبه ومؤهلاته التي تدرب عليها من المنظمة / المنظمات التي أصدرت له رخصة غوص دولية معتمدة.\n" +
                    "\u25CF  يقر محترف الغوص أن النشاط المعلن عنه في تطبيق غواص قد حصل على التأهيل اللازم بإقامته من منظمات الغوص الدولية المعتمدة ، وأنه لا يخاطر أو يجازف بالغواصين المشتركين معه في النشاط سواء كان تسجيلهم في النشاط عن طريق تطبيق غواص أو من خارجه، وأنه يعتني بالغواصين عناية الرجل الحريص وأن يحافظ على سلامتهم وأن يراعي أصول الممارسات الدولية للغوص للمنظمة / المنظمات التي محترف الغوص مؤهل منها." +
                    "\u25CF  على محترف الغواص اتباع القوانين المحلية التي يقيم فيها أنشطته، ويكون هو المسئول الوحيد عن أي تراخيص أو أوراق أو مستندات من الجهات الحكومية أو الخاصة للغوص في أي موقع يعلن عنه محترف الغوص ، وأن يتحمل مسئولية الغواصين المسجلين تحت اسمه مسئولية كاملة من وقت بدأ النشاط وحتى انتهاء النشاط وبعده وفقا للمعايير الدولية .\n" +
                    "\u25CF  على محترف الغوص تأكيد حضور الغواص قبل أو أثناء أو بعد النشاط باستخدام الماسح الإلكتروني (QR code) ، وبناء على تأكيد الحضور يوافق محترف الغوص على كافة بنود المسئولية القانونية والالتزامات المالية المستحقة بينه وبين تطبيق غواص. \n" +
                    "\u25CF  على محترف الغوص أن يقدم تقييمه عن الغواص بشكل احترافي ومنصف ويبتعد عن التجريح أو السباب أو الألفاظ البذيئة ، مما قد يترتب عليه اجراءات قانونية بناء على قانون الجرائم الإلكترونية والمعلوماتية في الدولة التي يقام فيها النشاط، كما يحق لإدارة تطبيق غواص إخفاء التعليق والتقرير عنه إلى الجهات المختصة وفق الإجراءات المتبعة في الحالات المماثلة. \n" +
                    "\u25CF  تطبيق غواص لا يضمن أي تصرفات فردية من محترف الغوص أو الغواص وليس مسئولا عنها بأي شكل من الأشكال. وعلى كلا الطرفين حل النزاعات بشكل ودي بالطرق النظامية وأن لا تتدخل ادارة التطبيق في حلها بأي شكل من الأشكال. \n" +
                    "\u25CF  على محترف الغوص أن يحدث بياناته باستمرار بحيث يكون بحالة نشطة وصالحة للقيام بالأنشطة التي يعلن عنها في التطبيق من المنظمة المؤهلة للمحترف، و بموافقته على السياسات والأحكام فإنه يفوض إدارة التطبيق بتعليق عضويته في حال انتهاء صلاحية أحد مستنداته المقدمة في التطبيق على سبيل المثال لا الحصر ( رخصة الغوص الاحترافية الدولية ، الهوية الوطنية ، جواز السفر) . \n" +
                    "\u25CF  محترف الغوص مسئول عن المعلومات البنكية المقدمة في التطبيق على سبيل المثال لا الحصر ( رقم الحساب البنك ، اسم البنك ، الفرع ، رقم IBAN ) وغيرها من المعلومات التي تعتبر أساسية لتحويل الأموال الواردة له من الغواصين. \n" +
                    "\u25CF  بموجب الموافقة على السياسات والأحكام، يخول محترف الغواص إدارة تطبيق غواص باستقطاع النسبة المتفق عليها مع إدارة تطبيق غواص، سواء كان النشاط خاص أو عام ويعتبر هذا المبلغ مقابل إدارة التطبيق وفريق العمل والتسويق عن الأنشطة المعلن عنها من طرف محترف الغوص في التطبيق. \n" +
                    "\u25CF  في حال طلب محترف الغوص تحصيل المبالغ نقدا ، فإنه يلتزم بدفع ما نسبته 15 % من المبلغ الإجمالي لعدد المقاعد المعروضة في التطبيق بناء على المبلغ المحدد من قبل المحترف أثناء إضافة النشاط. \n"+
                    "\u25CF  لا يحق لمحترف الغوص بالمطالبة بالمبالغ المدفوعة من قبل الغواصين الذي لم يؤكدوا حضورهم باستخدام رمز ( QR code ) ، حتى وإن حضروا إلى النشاط المقام من قبل محترف الغوص. \n"+
                    "\u25CF  يعتبر تقديم الوجبات الغذائية المشروبات أثناء النشاط بأنواعها مسئولية محترف الغوص المعلن عنه في التطبيق، وهو المسئول الوحيد عن جودتها وصلاحيتها والتأكد من ملائمتها للغواصين المشاركين معه في الفعالية ، ولا تقع أي مسئولية على إدارة تطبيق غواص أو تطبيق محترف الغوص بأي شكل من الأشكال . \n"+
                    "\u25CF  يعتبر التأمين على الغواص أو محترف الغواص خاضعا للقوانين المحلية ، وعلى كل من الغواص ومحترف الغواص اتباع القوانين المحلية فيما يتعلق بالتأمين واشتراطاته إن وجد.\n"+
                    "\u25CF  تقع مسئولية توفير معدات غوص للايجار على محترف الغوص إذا أعلن أن النشاط يشمل تأجير معدات ، وعليه التأكد من سلامتها وصلاحيتها وأنها لا تعرض الغواص للخطر. \n"+
                    "\u25CF  يجب على محترف الغوص أن يتعامل من جميع العملاء و الغواصين بطريقة احترافية ومنظمة وفقا لأصول الممارسات ومما يمثل دينه ثم وطنه والمجتمع ثم نفسه ، وأن يطور من الخدمات المقدمة من طرفه وأن يعمل ويجتهد اجتهاد الرجل الحريص في خدمة عملائه ، وألا يسيء إلى دينه أو وطنه أو زملائه أو عملائه أو إدارة التطبيق بأي تعدي أو لفظ من شأنه أن يضر الطرف الآخر، وتعتبر هذه التصرفات تصرفات فردية يحاسب عليها محترف الغوص المسئول عن النشاط إذا ما ثبت بالدليل الذي لا يحتمل الشك من قبل الجهات المعنية ، ولا علاقة لإدارة تطبيق غواص أو موظفوها أو المحترفين الآخرين المسجلين فيها أو العملاء المسجلين أي علاقة أو مسئولية سواء قانونية أو غير قانونية عن هذا التصرف الفردي من محترف الغوص ، كما يحق لإدارة التطبيق شطب عضويته نهائيا والتبليغ عن التصرف إلى الجهات المختصة بما يحفظ جميع الحقوق لجميع الأطراف.\n";
            return terms;
        }else{
            // DIVER
            userTypeTV.setText("الشروط والأحكام ( الغواص ):");
            String terms = "\u25CF  يقر الغواص أن الغوص يعتبر من الأنشطة الخطيرة التي قد تسبب الوفاة لاسمح الله أو العجز الدائم ، وعليه فإن الغواص يخلي مسئولية إدارة تطبيق غواص من أي التزامات قانونية يتعرضون لها قبل أو أثناء أو بعد الغوص أو بسببه.  \n" +
                    "\u25CF  يؤكد الغواص الغوص أنهم ملتزم بمعايير السلامة الدولية، و أن يغوص في حدود تدريبه ومؤهلاته التي تدرب عليها من المنظمة التي أصدرت له رخصة الغوص الدولية ، وأن يبلغ عن أي تجاوز يحصل أثناء النشاط يتجاوز حدود تدريبه إلى إدارة تطبيق غواص أثناء عملية تقييم محترف الغوص أو بعدها في صفحة الشكاوى والملاحظات. \n" +
                    "\u25CF  على الغواص تأكيد الحضور باستخدام الماسح الإلكتروني (QR code) ، وبناء على تأكيد الحضور يوافق  على كافة بنود المسئولية القانونية والالتزامات المالية المستحقة عليه. \n" +
                    "\u25CF  يوافق الغواص أن المبالغ المدفوعة عن طريق نظام الدفع الإلكتروني في تطبيق غواص لا تسترد وعليه التواصل مع إدارة التطبيق لأي ملاحظات على العمليات المالية. \n" +
                    "\u25CF  على الغواص أن يقدم تقييمه عن محترف الغوص بشكل احترافي ومنصف ويبتعد عن التجريح أو السباب أو الألفاظ البذيئة ، مما قد يترتب عليه اجراءات قانونية بناء على قانون الجرائم الإلكترونية والمعلوماتية في الدولة التي يقام فيها النشاط، كما يحق لإدارة تطبيق غواص إخفاء التعليق والتقرير عنه إلى الجهات المختصة وفق الإجراءات المتبعة في الحالات المماثلة. \n" +
                    "\u25CF  تطبيق غواص لا يضمن أي تصرفات فردية من محترف الغوص أو الغواص وليس مسئولا عنها بأي شكل من الأشكال. وعلى كلا الطرفين حل النزاعات بشكل ودي بالطرق النظامية وأن لا تتدخل ادارة التطبيق في حلها بأي شكل من الأشكال. \n" +
                    "\u25CF  يوافق الغواص على دفع ضريبة القيمة المضافة قدرها (5%) بناء على الأحكام والشروط الصادرة من الجهات الحكومية المختصة. وقد تتغير هذه النسبة من الجهات الحكومية دون إشعار مسبق أو تنبيه. \n" +
                    "\u25CF  يمنع منعا باتا التدخين وتناول الممنوعات أثناء الانشطة المعلن عنها في تطبيق غواص أو غيرها ، ويتعهد الغواص بالمحافظة على البيئة البحرية محافظة الرجل الحريص ، وأن لا يلقي المخلفات في البحر ، ويتحمل مخالف التعليمات كامل المسئولية عن الأثار المترتبة على المخالفة الخاصة بذلك. \n" +
                    "\u25CF  على الغواص اتباع تعليمات محترف الغوص أثناء الأنشطة وإن كان الغواص (العميل) أعلى مرتبة من محترف الغوص منظم الرحلة (مالم تكن مخالفة لأصول الممارسات الدولية)، وأن يتبع التعليمات الخاصة بالموقع والتصاريح والتراخيص اللازمة لممارسة النشاط ، ويحق لمحترف الغوص الامتناع عن تقديم الخدمة في حالة مخالفة تعليماته ( وخصوصا ما يتعلق بسلامة الغواص وسلامة المجموعة التي معه) وعليه أن يبلغ إدارة تطبيق غواص عن طريق نموذج التقييم المخصص للغواص بعد انتهاء النشاط . \n" +
                    "\u25CF  على الغواص الافصاح عن الحالة الصحية في الملف الخاص به (نبذة عن الغواص) ، ويخول الغواص أن يطلع محترف الغوص على ملفه الخاص ، حرصا على سلامة الغواص وسلامة المجموعة التي مع محترف الغواص في نفس النشاط. \n" ;
            return terms;
        }
    }
}
